Indicates if the field is a calculated field (Formula or Percentage).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public bool IsCalculatedField { get; }
  Visual Basic
Public ReadOnly Property IsCalculatedField As Boolean
	Get
  Visual C++
public:
property bool IsCalculatedField {
	bool get ();
}
 See Also
  ScheduleField Class
  Autodesk.Revit.DB Namespace